app/Controllers/Categorias.php

		public function index($estado = 1){

			$categorias = $this->categorias->where('estado',$estado)->findAll();
---
SELECT *
FROM `categorias`
WHERE `estado` = 1