app/Controllers/Compras.php

    public function index($estado = 1){

            $compras = $this->compras->where('estado',$estado)->findAll();
---
SELECT *
FROM `compras`
WHERE `estado` = 1

        public function guarda(){

            $id_compra = $this->request->getPost('id_compra');
            $total = $this->request->getPost('total');

            $this->compras->insertarCompra($id_compra, $total);

            $resultado_id = $this->compras->insertarCompra($id_compra, $total);

            $this->temporal_compra = new TemporalModel();

            if ($resultado_id) {

                $resultadoCompra = $this->temporal_compra->porCompra($id_compra);
                foreach ($resultadoCompra as $row) {

                    $this->detalle_compra->save([
                        'id_compra' => $resultado_id,
                        'id_producto' => $row['id_producto'],
                        'nombre'   => $row['nombre'],
                        'cantidad' => $row['cantidad'],
                        'precio'   => $row['precio']
                    ]);
---
INSERT INTO `detalle_compra` (`id_compra`, `id_producto`, `nombre`, `cantidad`, `precio`, `fecha_reg`) VALUES (8, '1', 'Café Americano', '1', '5000.00', '2022-04-10 12:58:09')