app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `estado` = 1
---
		public function index($estado = 1){

			$productos = $this->productos->where('estado',$estado)->findAll();

SELECT *
FROM `productos`
WHERE `referencia` = '123'
AND `estado` = 1
---
               public function buscarCodigo($codigo){
                   $this->productos->select('*');
                   $this->productos->where('referencia',$codigo);
                   $this->productos->where('estado',1);

                   $datos= $this->productos->get()->getRow();