app/Controllers/Unidades.php

SELECT *
FROM `unidades`
WHERE `estado` = 1
---
    public function index($estado = 1){

            $unidades = $this->unidades->where('estado',$estado)->findAll();

INSERT INTO `unidades` (`nombre`, `nombre_corto`, `fecha_reg`, `fecha_edit`) VALUES ('Libras', 'Lb', '2022-04-09 18:45:26', '2022-04-09 18:45:26')
---
        public function insertar(){

            // if($this->request->getMethod() "POST" && Sthis->validate(['nombre => 'required', 'nombre_corto' =>'required' ])){

            if ($this ->request ->getMethod()== "post" && $this ->validate($this->reglas)) {

            $this->unidades->save(['nombre'=> $this->request->getPost('nombre'), 'nombre_corto'=> $this->request->getPost('nombre_corto')]);