app/Models/ProductosModel.php

		public function actualizastock($id_producto, $cantidad){
			$this->set('cantidad_sold', "cantidad_sold + $cantidad", FALSE);
			$this->where('id', $id_producto);
			$this->update();
---
UPDATE `productos` SET `cantidad_sold` = cantidad_sold + 1
WHERE `id` = '1'